---
kind: other
id: Properties.T:Autodesk.Revit.DB.AppearanceAssetElement
source: html/a2061c27-5b60-adf5-cc50-a3b6c0d27fb6.htm
---
# AppearanceAssetElement Properties

The id of the assembly instance to which the element belongs.